from datetime import datetime
dt_in_str = '8-13-24 PM 5:06:35 +23:00'
format_dt = "%m-%d-%y %p %I:%M:%S %z"


# from_iso_obj = datetime.strptime(dt_in_str, format_dt)
# print(dt_in_str)
# print(from_iso_obj)
# print(from_iso_obj.hour)
# print(from_iso_obj.tzname())


# print(type(str_from_dt_obj))
# print(str_from_dt_obj)




# %Y - Рік у форматі з чотирма цифрами (наприклад, 2023).
# %y - Рік у форматі з двома цифрами (наприклад, 23).
# %m - Місяць у числовому форматі (01-12).
# %B - Повна назва місяця (наприклад, січня).
# %b або %h - Скорочена назва місяця (наприклад, січ.).
# %d - День місяця у числовому форматі (01-31).
# %A - Повна назва дня тижня (наприклад, понеділок).
# %a - Скорочена назва дня тижня (наприклад, пн).
# %H - Година у 24-годинному форматі (00-23).
# %I - Година у 12-годинному форматі (01-12).
# %p - AM або PM.
# %M - Хвилини (00-59).
# %S - Секунди (00-59).
# %f - Мікросекунди (000000-999999).
# %z - Зона часу UTC з або без знака + або -.
# %Z - Назва часового поясу або абревіатура (наприклад, UTC, EST).
# %j - День року у числовому форматі (001-366).
# %U - Номер тижня у році, де неділя - перший день тижня (00-53).
# %W - Номер тижня у році, де понеділок - перший день тижня (00-53).
# %c - Дата та час у локальному форматі.
# %x - Дата у локальному форматі.
# %X - Час у локальному форматі.

